nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_cmp.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief CMP driver version 2.0.0. */
#define FSL_CMP_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/*! @brief CMP Interrupt request type definition */
typedef enum _cmp_interrupt_request
{
    kCMP_InterruptRequestDisabled = 0U, /*!< interrupt disabled */
    kCMP_InterruptRequestEnableOutputRisingEdge =
        CMP_SCR_IER_MASK, /*!< Comparator interrupt request enable rising edge. */
    kCMP_InterruptRequestEnableOutputFallingEdge =
        CMP_SCR_IEF_MASK, /*!< Comparator interrupt request enable falling edge. */
    kCMP_InterrruptRequestEnableAll =
        CMP_SCR_IER_MASK | CMP_SCR_IEF_MASK, /*!< comparator interrupt request enable on rising edge or falling edge */
} cmp_interrupt_request_t;

/*! @brief CMP DMA request type definition */
typedef enum _cmp_dma_request
{
    kCMP_DMARequestDisabled = 0U, /*!< DMA disabled */
    kCMP_DMARequestEnableOutputRisingEdge =
        CMP_SCR_IER_MASK | CMP_SCR_DMAEN_MASK, /*!< Comparator dma request enable on rising edge. */
    kCMP_DMARequestEnableOutputFallingEdge =
        CMP_SCR_IEF_MASK | CMP_SCR_DMAEN_MASK, /*!< Comparator dnma request enable on falling edge. */
    kCMP_DMARequestEnableAll = CMP_SCR_IER_MASK | CMP_SCR_IEF_MASK |
                               CMP_SCR_DMAEN_MASK, /*!< comparator dma request enable on rising edge or falling edge */
} cmp_dma_request_t;

/*! @brief CMP output flags' mask */
typedef enum _cmp_output_flag
{
    kCMP_OutputFlagRisingEdge  = CMP_SCR_CFR_MASK, /*!< Rising-edge on the comparison output has occurred. */
    kCMP_OutputFlagFallingEdge = CMP_SCR_CFF_MASK, /*!< Falling-edge on the comparison output has occurred. */
    kCMP_OutputFlagBothEdge =
        CMP_SCR_CFF_MASK | CMP_SCR_CFR_MASK, /*!< Rising-edge and Falling-edge on the comparison output has occurred. */
} cmp_output_flag_t;

/*! @brief CMP Hysteresis level */
typedef enum _cmp_hysteresis_level
{
    kCMP_HysteresisLevel0 = 0U, /*!< Hysteresis level 0. */
    kCMP_HysteresisLevel1 = 1U, /*!< Hysteresis level 1. */
    kCMP_HysteresisLevel2 = 2U, /*!< Hysteresis level 2. */
    kCMP_HysteresisLevel3 = 3U, /*!< Hysteresis level 3. */
} cmp_hysteresis_level_t;

/*! @brief CMP compassion speed mode enumerator */
typedef enum _cmp_comparasion_speed_mode
{
    kCMP_ComparsionModeLowSpeed  = 0U, /*!< Low-Speed Comparison mode has lower current consumption */
    kCMP_ComparsionModeHighSpeed = 1U, /*!< High-Speed Comparison mode has higher current consumption. */
} cmp_comparasion_speed_mode_t;

/*! @brief CMP DAC Voltage Reference source */
typedef enum _cmp_dac_vref_source
{
    kCMP_DACVrefSourceVin1 = 0U, /*!< Vin1 is selected as a resistor ladder network supply reference Vin. */
    kCMP_DACVrefSourceVin2 = 1U, /*!< Vin2 is selected as a resistor ladder network supply reference Vin. */
} cmp_dac_vref_source_t;

/*! @brief CMP output value of window */
typedef enum _cmp_window_output_mode
{
    kCMP_WindowOuputLastLatchedValue =
        0U,                          /*!< When WINDOW signal changes from 1 to 0,
                                       COUTA output holds the last latched value before WINDOW signal falls to 0   */
    kCMP_WindowOutputZeroValue = 1U, /*!< When WINDOW signal changes from 1 to 0, COUTA output is forced to 0*/
} cmp_window_output_mode_t;

/*! @brief CMP filter count */
typedef enum _cmp_filter_count
{
    kCMP_FilterCountDisable = 0U, /*!< filter is disabled */
    kCMP_FilterCount1       = 1U, /*!< 1 sample must agrees, the comparator output is simply sampled */
    kCMP_FilterCount2       = 2U, /*!< 2 consecutive samples must agrees */
    kCMP_FilterCount3       = 3U, /*!< 3 consecutive samples must agrees */
    kCMP_FilterCount4       = 4U, /*!< 4 consecutive samples must agrees */
    kCMP_FilterCount5       = 5U, /*!< 5 consecutive samples must agrees */
    kCMP_FilterCount6       = 6U, /*!< 6 consecutive samples must agrees */
    kCMP_FilterCount7       = 7U, /*!< 7 consecutive samples must agrees */
} cmp_filter_count_t;

/*! @brief CMP external sample count */
typedef enum _cmp_external_sample_count
{
    kCMP_ExternalSampleCount1 = 1U, /*!< 1 sample must agrees, the comparator output is simply sampled */
    kCMP_ExternalSampleCount2 = 2U, /*!< 2 consecutive samples must agrees */
    kCMP_ExternalSampleCount3 = 3U, /*!< 3 consecutive samples must agrees */
    kCMP_ExternalSampleCount4 = 4U, /*!< 4 consecutive samples must agrees */
    kCMP_ExternalSampleCount5 = 5U, /*!< 5 consecutive samples must agrees */
    kCMP_ExternalSampleCount6 = 6U, /*!< 6 consecutive samples must agrees */
    kCMP_ExternalSampleCount7 = 7U, /*!< 7 consecutive samples must agrees */
} cmp_external_sample_count_t;

/*! @brief CMP output source enumerator */
typedef enum _cmp_output_source
{
    kCMP_OutputSourceFromFilterCOUT      = 0U, /*!< Set the filtered comparator output to equal COUT. */
    kCMP_OutputSourceFromUnfilteredCOUTA = 1U, /*!< Set the unfiltered comparator output to equal COUTA. */
} cmp_output_source_t;

/*! @brief CMP work mode definition */
typedef enum _cmp_work_mode
{
    kCMP_WorkModeWindowBypassAndNoExternalSample  = 0U, /*!< window block bypassed, external sampling mode disabled */
    kCMP_WorkModeWindowBypassAndExternalSample    = 1U, /*!< window block bypassed, external SAMPLE mode enable */
    kCMP_WorkModeWindowEnabledAndNoExternalSample = 2U, /*!< window block enabled, external sampling mode disabled */
} cmp_work_mode_t;

/*! @brief CMP internal DAC configuration structure */
typedef struct _cmp_dac_config
{
    cmp_dac_vref_source_t eDACVrefSource; /*!< DAC reference voltage source. */
    uint8_t u8DACOutputVoltageDivider;    /*!< divider Value for the DAC Output Voltage,
                                            DAC output voltage = (VREF / 256) * (u8DACOutputVoltageDivider + 1).*/
    bool bEnableInternalDAC;              /*!< flag to control if the internal DAC need to be enabled */
} cmp_dac_config_t;

/*! @brief CMP dma/interrupt configure union
 *
 * @note, the interrupt request and dma request cannot be used at the same time, that is to say
 * When DMA support is enabled by setting SCR[DMAEN] and the interrupt is enabled by setting
 * SCR[IER], SCR[IEF], or both, the corresponding change on COUT forces a DMA
 * transfer request rather than a CPU interrupt instead
 */
typedef union _cmp_dma_interrupt_config
{
    cmp_dma_request_t eDMARequest;             /*!< dma request type */
    cmp_interrupt_request_t eInterruptRequest; /*!< interrupt request type */
} cmp_dma_interrupt_config_t;

