nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_cmp.h
/*! @brief CMP configuration structure */
typedef struct _cmp_config
{
    cmp_hysteresis_level_t eHysteresisLevel;            /*!< CMP hysteresis leveL */
    cmp_comparasion_speed_mode_t eComparasionSpeedMode; /*!< CMP comparison speed mode */

    cmp_work_mode_t eWorkMode; /*!< CMP work mode */

    cmp_input_mux_t ePlusInput;  /*!< CMP plus input mux, the definition of this enum is in soc header file */
    cmp_input_mux_t eMinusInput; /*!< CMP minus input mux, the definition of this enum is in soc header file */
    cmp_dac_config_t sDacConfig; /*!< CMP internal DAC configuration structure @ref cmp_dac_config_t */

    bool bInvertComparatorOutputPolarity; /*!< Inverted comparator output polarity. */

    cmp_window_output_mode_t
        eWindowOutputMode; /*!< only works when cmp work mode is kCMP_WorkModeWindowEnabledAndNoExternalSample */

    cmp_filter_count_t eFilterCount; /*!< Filter Count.Available range is 0-7, 0 is disable internal filter
                                               can be used in internal sampling mode only.*/
    uint8_t u8FilterPeriod;          /*!< Filter Period. The divider to the bus clock.
                                                               Available range is 0-255, can be used in internal sampling mode.
                                                               When the filter clock from internal divided bus clock,
                                                               setting the sample period to 0 will disable the filter */

    cmp_external_sample_count_t
        eExternalSampleCount; /*!< Available range is 1 - 7, used in external sampling mode only */

    cmp_output_source_t eOutputSource; /*!< cmp output source */
    bool bEnableOutputPin; /*!< the comparator output(CMPO) is driven out on the associated CMPO output pin */

    cmp_dma_interrupt_config_t uDmaInterruptConfig; /*!< CMP interrupt/dma configuration */

    bool bCMPEnable; /*!< flag to control if CMP module start immediately when the configuration is done */
} cmp_config_t;

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
 * API
 ******************************************************************************/

/*!
 * @name CMP Initialization and de-initialization interfaces
 * @{
 */

/*!
 * @brief Initializes the CMP user configuration structure.
 *
 * This function initializes the user configuration structure to the default values.
 * It is corresponding to the continuous mode configurations.
 *
 * @param psConfig pointer of cmp_config_t.
 */
void CMP_GetDefaultConfig(cmp_config_t *psConfig);

/*!
 * @brief Initializes the CMP.
 *
 * This function initializes the CMP module. The operations included are as follows.
 * - Enable the clock for CMP module.
 * - Configure the comparator according to the CMP configuration structure.
 *
 * @param base   CMP peripheral base address.
 * @param psConfig Pointer to the configuration structure.
 *
 */
void CMP_Init(CMP_Type *base, const cmp_config_t *psConfig);

/*!
 * @brief De-initializes the CMP module.
 *
 * This function de-initializes the CMP module. The operations included are as follows.
 * - Disabling the CMP module.
 * - Disabling the clock for CMP module.
 *
 * @param base CMP peripheral base address.
 */
void CMP_Deinit(CMP_Type *base);

/* @} */

/*!
 * @name CMP functional interfaces
 * @{
 */

/*!
 * @brief Enables/disables the CMP module.
 *
 * @param base CMP peripheral base address.
 * @param enable Enables or disables the module.
 */
static inline void CMP_Enable(CMP_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CR1 |= CMP_CR1_EN_MASK;
    }
    else
    {
        base->CR1 &= ~(uint8_t)CMP_CR1_EN_MASK;
    }
}

/*!
 * @brief  Sets the input channels for the comparator.
 *
 * This function sets the input channels for the comparator.
 * Note that two input channels cannot be set the same way in the application. When the user selects the same input
 * from the analog mux to the positive and negative port, the comparator is disabled automatically.
 *
 * @param  base            CMP peripheral base address.
 * @param  ePlusChannel Plus side input channel number, @ref cmp_input_mux_t.
 * @param  eMinusChannel Minus side input channel number, @ref cmp_input_mux_t.
 */
static inline void CMP_SetInputChannel(CMP_Type *base, cmp_input_mux_t ePlusChannel, cmp_input_mux_t eMinusChannel)
{
    uint8_t u8Tmp = base->MUXCR;

    u8Tmp &= ~(uint8_t)(CMP_MUXCR_PSEL_MASK | CMP_MUXCR_MSEL_MASK);
    u8Tmp |= CMP_MUXCR_PSEL(ePlusChannel) | CMP_MUXCR_MSEL(eMinusChannel);
    base->MUXCR = u8Tmp;
}

/*!
 * @brief Select comparator output source.
 *
 * @param base CMP peripheral base address.
 * @param eOutputSource The output signal to be set, please reference @ref cmp_output_source_t for details.
 */
static inline void CMP_SelectOutputSource(CMP_Type *base, cmp_output_source_t eOutputSource)
{
    if (eOutputSource == kCMP_OutputSourceFromFilterCOUT)
    {
        base->CR1 &= (uint8_t)(~CMP_CR1_COS_MASK);
    }
    else
    {
        base->CR1 |= CMP_CR1_COS_MASK;
    }
}

/*!
 * @brief Enable/Disable Comparator output pin.
 *
 * @param base CMP peripheral base address.
 * @param bEnable Enable/Disable comparator output pin.
 *              true    --    CMPO is available on the associate CMPO output pin.
 *              false    --   CMPO is not available on the associate CMPO output pin.
 */
static inline void CMP_EnableOuputPin(CMP_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CR1 |= CMP_CR1_OPE_MASK;
    }
    else
    {
        base->CR1 &= (uint8_t)(~CMP_CR1_OPE_MASK);
    }
}

/*!
 * @brief Get Comparator output.
 *
 * @param base CMP peripheral base address.
 * @retval current analog comparator output 0 or 1
 */
static inline uint8_t CMP_GetComparatorOutput(CMP_Type *base)
{
    return base->SCR & CMP_SCR_COUT_MASK;
}

/*!
 * @brief Sets hysteresis level.
 *
 * @param base CMP peripheral base address.
 * @param eHysteresisLevel The programmable hysteresis level to be set, please refer to @ref cmp_hysteresis_level_t for
 * details.
 */
static inline void CMP_SetHysteresisLevel(CMP_Type *base, cmp_hysteresis_level_t eHysteresisLevel)
{
    base->CR0 = ((base->CR0) & (uint8_t)(~CMP_CR0_HYSTCTR_MASK)) | CMP_CR0_HYSTCTR(eHysteresisLevel);
}

/*!
 * @brief Sets comparison speed mode.
 *
 * @param base CMP peripheral base address.
 * @param eComparatorSpeedMode The comparison speed mode, please reference @ref cmp_comparasion_speed_mode_t for
 * details.
 */
static inline void CMP_SetComparasionSpeedMode(CMP_Type *base, cmp_comparasion_speed_mode_t eComparatorSpeedMode)
{
    if (eComparatorSpeedMode == kCMP_ComparsionModeLowSpeed)
    {
        base->CR1 &= (uint8_t)(~CMP_CR1_PMODE_MASK);
    }
    else
    {
        base->CR1 |= CMP_CR1_PMODE_MASK;
    }
}

/*!
 * @brief Enable/Disable comparator invert feature.
 *
 * @param base CMP peripheral base address.
 * @param bEnable Enable/Disable comparator invert feature.
 *              true    --    Inverts the comparator output.
 *              false   --    Does not invert the comparator output.
 */
static inline void CMP_EnableInvertOutput(CMP_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CR1 |= CMP_CR1_INV_MASK;
    }
    else
    {
        base->CR1 &= (uint8_t)(~CMP_CR1_INV_MASK);
    }
}

/*!
 * @brief Enable the window function.
 *
 * @param base CMP peripheral base address.
 * @param bEnable true is enable, false is disable.
 */
static inline void CMP_EnableWindow(CMP_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CR1 |= CMP_CR1_WE_MASK;
    }
    else
    {
        base->CR1 &= ~CMP_CR1_WE_MASK;
    }
}

/*!
 * @brief Set the window output mode.
 *
 * @param base CMP peripheral base address.
 * @param eWindowOutputMode @ref cmp_window_output_mode_t.
 */
static inline void CMP_SetWindowOutputMode(CMP_Type *base, cmp_window_output_mode_t eWindowOutputMode)
{
    if (eWindowOutputMode == kCMP_WindowOutputZeroValue)
    {
        base->CR1 |= CMP_CR1_COWZ_MASK;
    }
    else
    {
        base->CR1 &= ~CMP_CR1_COWZ_MASK;
    }
}

/*!
 * @brief Enable/Disable external Sample mode.
 *
 * @param base CMP peripheral base address.
 * @param bEnable true is using external sample mode, false is using interface sample mode.
 */
static inline void CMP_EnableExternalSampleMode(CMP_Type *base, bool bEnable)
{
    base->CR1 = (base->CR1 & (uint8_t)(~CMP_CR1_SE_MASK)) | (CMP_CR1_SE(bEnable));
}

/*!
 * @brief Sets external sample count.
 *
 * @param base CMP peripheral base address.
 * @param eSampleCount The number of consecutive samples that must agree prior to the comparator output
 *              filter accepting a new output state, @ref cmp_external_sample_count_t.
 */
static inline void CMP_SetExternalSampleCount(CMP_Type *base, cmp_external_sample_count_t eSampleCount)
{
    base->CR0 = (base->CR0 & ((uint8_t)~CMP_CR0_FILTER_CNT_MASK)) | CMP_CR0_FILTER_CNT(eSampleCount);
}

/*!
 * @brief Sets internal filter count.
 *
 * @param base CMP peripheral base address.
 * @param eFilterCount The number of consecutive samples that must agree prior to the comparator output
 *              filter accepting a new output state, @ref cmp_filter_count_t.
 */
static inline void CMP_SetInternalFilterCount(CMP_Type *base, cmp_filter_count_t eFilterCount)
{
    base->CR0 = (base->CR0 & ((uint8_t)~CMP_CR0_FILTER_CNT_MASK)) | CMP_CR0_FILTER_CNT(eFilterCount);
}

/*!
 * @brief Sets the internal filter period. It is used as the divider to bus clock.
 *
 * @param base CMP peripheral base address.
 * @param u8FilterPeriod Filter Period. The divider to the bus clock. Available range is 0-255.
 */
static inline void CMP_SetInternalFilterPeriod(CMP_Type *base, uint8_t u8FilterPeriod)
{
    base->FPR = CMP_FPR_FILT_PER(u8FilterPeriod);
}

/*!
 * @brief Configures the internal DAC.
 *
 * @param base   CMP peripheral base address.
 * @param psConfig Pointer to the configuration structure.
 */
void CMP_SetDACConfig(CMP_Type *base, const cmp_dac_config_t *psConfig);

/*!
 * @brief Sets DAC output voltage.
 *
 * @param base CMP peripheral base address.
 * @param u8OutputVoltageDivider The digital value which is related to the desired DAC output voltage,
 */
static inline void CMP_SetDACOutputVoltage(CMP_Type *base, uint8_t u8OutputVoltageDivider)
{
    base->DACCR = CMP_DACCR_VOSEL(u8OutputVoltageDivider);
}

/*!
 * @brief Enable/Disable internal DAC.
 *
 * @param base CMP peripheral base address.
 * @param bEnable Enable/Disable internal DAC.
 *              true    --    Enable internal DAC.
 *              false   --    Disable internal DAC.
 */
static inline void CMP_EnableInternalDAC(CMP_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->MUXCR |= CMP_MUXCR_DACEN_MASK;
    }
    else
    {
        base->MUXCR &= (uint8_t)(~CMP_MUXCR_DACEN_MASK);
    }
}

/*!
 * @brief Sets internal DAC's reference voltage source.
 *
 * @param base CMP peripheral base address.
 * @param eDACVrefSource reference voltage source, please @ref cmp_dac_vref_source_t
 */
static inline void CMP_SetDACReferenceVoltageSource(CMP_Type *base, cmp_dac_vref_source_t eDACVrefSource)
{
    if (eDACVrefSource == kCMP_DACVrefSourceVin1)
    {
        base->MUXCR &= ~CMP_MUXCR_VRSEL_MASK;
    }
    else
    {
        base->MUXCR |= CMP_MUXCR_VRSEL_MASK;
    }
}

/* @} */

/*!
 * @name CMP interrupt interfaces
 * @{
 */

/*!
 * @brief Interrupt request to enable.
 *
 * @param base    CMP peripheral base address.
 * @param eInterruptRequest    Mask value for interrupts. See @ref cmp_interrupt_request_t.
 */
static inline void CMP_EnableInterrupt(CMP_Type *base, cmp_interrupt_request_t eInterruptRequest)
{
    base->SCR = (base->SCR & (~(CMP_SCR_IER_MASK | CMP_SCR_IEF_MASK | CMP_SCR_DMAEN_MASK))) | eInterruptRequest;
}
/* @} */

/*!
 * @name CMP status interfaces
 * @{
 */

/*!
 * @brief  Gets the status flags.
 *
 * @param  base     CMP peripheral base address.
 *
 * @retval          Mask value for the asserted flags. @ref cmp_output_flag_t.
 */
static inline cmp_output_flag_t CMP_GetStatusFlags(CMP_Type *base)
{
    return (cmp_output_flag_t)((base->SCR) & (CMP_SCR_CFR_MASK | CMP_SCR_CFF_MASK));
}

/*!
 * @brief Clears the status flags.
 *
 * @param base     CMP peripheral base address.
 * @param eOutputFlag     Mask value for the output flags, @ref cmp_output_flag_t
 */
static inline void CMP_ClearStatusFlags(CMP_Type *base, cmp_output_flag_t eOutputFlag)
{
    base->SCR = (((base->SCR) & (uint8_t)(~(CMP_SCR_CFR_MASK | CMP_SCR_CFF_MASK))) | eOutputFlag);
}

/* @} */

/*!
 * @name CMP DMA interfaces
 * @{
 */

/*!
 * @brief Enables CMP DMA request.
 *
 * @param base    CMP peripheral base address.
 * @param eDMARequestType @ref.cmp_dma_request_t
 */
static inline void CMP_EnableDMA(CMP_Type *base, cmp_dma_request_t eDMARequestType)
{
    base->SCR = (base->SCR & (~(CMP_SCR_IER_MASK | CMP_SCR_IEF_MASK | CMP_SCR_DMAEN_MASK))) | eDMARequestType;
}

/*!
 * @brief Get CMP result register address for DMA access.
 *
 * @param base    CMP peripheral base address.
 */
static inline void *CMP_GetComparatorResultRegisterAddress(CMP_Type *base)
{
    return (void *)&base->SCR;
}
/* @} */

#if defined(__cplusplus)
}
#endif
/*!
 * @}
 */
#endif /* _FSL_CMP_H_ */
